{
  "newlist": [
    {
      "id": 1,
      "pic": "/static/img/newlist1.png",
      "tit": "Ebang Listed on Nasdaq Global Select Market",
      "time": "2020-06-26 21:30:00",
      "intro": "On June 26, 2020 (Beijing, China), on June 26, Eastern Time, Ebang was officially listed on the Nasdaq...",
      "content": "On June 26, 2020 (Beijing, China), on June 26, Eastern Time, Ebang was officially listed on the Nasdaq Global Select Market in the United States under the ticker symbol \"EBON\". A total of 19,264,337 Class A common shares were issued in this initial public offering, with a public offering price of US$5.23 per share, and a total fundraising of approximately US$1007.5 million.<br><br>At 21:30 on June 26, 2020, Beijing time, the listing ceremony of Ebang Nasdaq was grandly held in Hangzhou, and Ebang officially landed in the US Nasdaq global select market.<br><br><div><img src=\"../../static/img/new081.png\"></img></div><br>On the brightly lit stage, the bell ringers and hundreds of media reporters, customer representatives, supplier representatives, company employees and other representatives from the audience witnessed the milestone of Ebang’s landing on the Nasdaq global select market.<br><br><div><img src=\"../../static/img/new082.png\"></img><img src=\"../../static/img/new083.png\"></img></div><br>Founder, Chairman and CEO of Ebang Mr. Hu Dong, Director and Vice President Ms. Peng Chunjuan & Ms. Wang Sufeng, CFO Chen Lei, Relevant leaders of Yuhang District Government of Hangzhou, Relevant leaders of Wuhai Hainan District Government of Inner Mongolia Autonomous Region participated in the bell ringing ceremony. The head of Nasdaq Exchange Asia Pacific, Bob McCooey delivered a speech and warmly welcomed Ebang to join Nasdaq Family.<br><br><div><img src=\"../../static/img/new084.png\"></img></div><br>2020 is a challenging year for the world. Ebang never forgets its original intentions, forges ahead, and successfully landed on the Nasdaq global select market. It is the high recognition of the Ebang by the capital market and the best gift that Ebang gives to its 10th birthday. All this is inseparable from the long-term strategic vision and courage and courage of Ebang people.<br><br>Since its establishment in 2010, Ebang has been adhering to the business philosophy of \"technical innovation, focused management, quality service, and customer priority\", with \"innovation, market, quality, unity\" as its entrepreneurial spirit. In the integrated circuit industry, Ebang has more than ten years of professional knowledge and production experience, strong ASIC chip design capabilities, and stable wafer foundry capabilities. Ebang puts superb technology into ASIC chip R&D and design, and is one of the earliest mining machine manufacturers in the industry to use 10nm ASIC chips for commercial use. At present, Ebang has completed the design of 8nm and 7nm ASIC chips, and began to focus on the development of 5nm ASIC chips and other non-bitcoin cryptocurrency mining machines.<br><br>In the future, Ebang will continue to use its deep understanding and practical experience in the cryptocurrency industry to strive to expand upstream and downstream of the entire industry chain. Explore the application of blockchain technology to non-cryptocurrency industries, such as education, financial services, and healthcare, and will gradually deploy fintech in the field of technology and finance to create a professional digital financial trading platform to serve investors. Upgrade the hosting and maintenance services to the computing power center to provide one-stop service.<br><br>"
    },
    {
      "id": 2,
      "pic":  "/static/img/newlist2.png",
      "tit": "INTRODUCING ZHEJIANG EBANG COMMUNICATION CO., LTD.",
      "time": "2019-05-29 11:22:30",
      "intro": "ZHEJIANG EBANG COMMUNICATION CO., LTD (hereinafter referred to as  'EBANG' ) is a national high-tech enterprise...",
      "content": "ZHEJIANG EBANG COMMUNICATION CO., LTD (hereinafter referred to as \"EBANG \") is a national high-tech enterprise, engaging in R&D, manufacture, sales, and service. It has obtained many honors such as undertaking National Innovation Fund projects, being identified as the provincial high-tech enterprise research and development center, and being awarded as Zhejiang science and technology-based small and medium-sized enterprise. It has the third level qualification of computer information system integration. The company has strong capability of design for integrated circuit chips, with 4 R&D centers located in Hangzhou, Shanghai, Wuhan, and Suzhou, with an R&D team of more than 150 members including core members with more than 10 years of experience in software and hardware R&D. At the same time, the company has cooperated with TSMC, Samsung, GF and SMIC which are recognized as the world's top chip production suppliers. The business of the company can be divided into three categories in general:<br><br>1. Integrated circuit Design business: Designing the self-developed supercomputer chip which can effectively handle a large number of repetitive operations; AI artificial intelligence data processor - supercomputing hardware which is designed for the effective processing of big data technology using artificial intelligence; designing communication transmission chips, 5G small base station, and signal transmission chips; designing chips for Internet of Things.<br><br>2. Blockchain Business: Providing top-notch blockchain computing equipment, being one of the three major specialized BPU manufacturers in the world; building Blockchain Data Center Infrastructure, designing leading and trusted accounts, realizing effective exchange of value data through consensus mechanism, promoting the virtuous circle of the general certification economy and strengthening the real economy; applications and solutions for non-encrypted currency blockchain products, building abilities to provide solutions for blockchain other than encrypted currency internally, which can be used in medical records, financial services management, etc.; building Blockchain Research Institute to engage in the building of blockchain industrial bases, via the innovative cooperation with major universities, focusing on the cooperation in  cutting-edge blockchain science and technology, the development of special industries of blockchain, the transformation of technological application achievements and talents ‘innovation and entrepreneurship.<br><br>3. Telecommunication Business: Optical network communication & connection equipment, providing telecommunication service providers with integrated network access communication plan, and providing technical solutions to improve the efficiency of pre-5G trans-access, improving the speed of restructuring the 5G network; enterprise integration communication products, providing enterprise clients with a complete set of integration communication plan, using communication information fusion technology (ICT) to provide a complete set of information solution plan to enterprise clients.<br><br>High-quality products and competitive R&D capabilities help EBANG to obtain a strong market position in the world. In the future, EBANG will continue to adhere to \"Integrated Circuit Design + Big Data Industry + Technological Innovation\", and with IC design, Big Data, Cloud Computing, Supercomputer Chip and 5G technology, EBANG will further expand the industrial chain of blockchain, communication and Internet of Things, promote diversification of business forms, and realize the common industrial upgrading of blockchain, communications and Internet of Things technology and the existing business, to promote an industry sharing and win-win ecological chain. "
    },
    {
      "id": 3,
      "pic": "/static/img/smart02.jpg",
      "tit": "Marching ahead of time：Ebang communication",
      "time": "2017-06-26 11:22:30",
      "intro": "On June 26, 2017, Mo Chongming（member of the Standing Committee of the Haixi Prefecture Committee of Qinghai...",
      "content": "On June 26, 2017, Mo Chongming（member of the Standing Committee of the Haixi Prefecture Committee of Qinghai Province, the executive deputy secretary of the Party Working Committee of the Qaidam Circular Economy Pilot Area, and the executive deputy director of the Management Committee）and his entourage investigated Ebang Communications and discussed the development of big data such as blocking and cloud computing. The company's leadership warmly welcomed the investigation.<br><br>Ebang’s deputy general manager and directors Ms. Peng Chunjuan and Ms. Wang Sufeng introduced the company's development history, R&D strength and service system to the research team in detail. In the future, Ebang will focus on the development of blockchain, cloud computing, and special chips for supercomputing, and establish distributed supercomputing centers.<br><br>The leader of the research group said that under the tide of big data, blockchain has been written as a key technology in the \"13th Five-Year Plan\". At present, the government has promoted big data such as blockchain and cloud computing as key high-tech industries，trying to run a new round of technological and industrial competition. The guidance and support of the government has also provided good endorsement and confidence for enterprises.<br><br>After the meeting, the research team, accompanied by the company's leadership, successively visited Ebang's office area, R&D center and production workshop. The clean and tidy office environment, efficient and orderly working atmosphere, independent advanced research and development technology and a complete range of products have been highly praised by the research team.<br><br>Ebang Communication will make persistent efforts, forge ahead and brave the tide!"
    },
    {
      "id": 4,
      "pic": "/static/img/smart01.jpg",
      "tit": "Blockchain Love Hangzhou-Deputy District Governor Mr. Xue Hongxiang Successfully Investigate Ebang",
      "time": "2017-05-25 11:22:30",
      "intro": "On May 25, 2017, in the hot atmosphere of the Hangzhou blockchain, Mr. Xue Hongxiang (deputy head ...",
      "content": "On May 25, 2017, in the hot atmosphere of the Hangzhou blockchain, Mr. Xue Hongxiang (deputy head of the Shangcheng District), accompanied by Mr. Yuan Weimin (member of the party committee, deputy director and researcher of the functional area management committee ) investigated the successful practice of the blockchain technology of Ebang. The company's chairman Mr. Hu Dong and his leadership expressed a warm welcome to the investigation.<br><br>Mr. Hu Dong introduced the company's development to the research team. From the company's years of experience and accumulation in the communications industry, the company successfully developed the EBIT blockchain computing equipment which has been highly recognized by the market, to the company's future key development areas like blockchain, cloud computing, and super-computing dedicated chips establish distributed super-computing centers. In the upsurge of blockchain, everyone has in-depth discussions and exchanges.<br><br>After the meeting, the research team accompanied by Mr. Hu Dong to visit the company's office area, R&D center and production workshop. The clean and tidy office environment, efficient and orderly working atmosphere, independent advanced research and development technology and a complete range of products have been highly praised by the research team.<br><br>Finally, the research team stated that it will continue to help the company's development and help solve the company's hardware support, service policies and other issues. Mr. Hu Dong expressed his gratitude to the company for its care and support in the past few years. At the same time, the research team hopes that the company will make a greater contribution to the upper city in terms of industrial chain collaborative ecology!"
    }
  ]
}

      